TutoElectroWeb/STM32_SGP40/STM32_SGP40.h
/**
  ******************************************************************************
  * @file    STM32_SGP40.h
  * @brief   Driver STM32 HAL pour capteur VOC SGP40 (Sensirion)
  * @author  Generated via STM32_LIB_STYLE_GUIDE.md
  * @date    2026-02-11
  * @version 0.9.0
  * @copyright Libre sous licence MIT.
  ******************************************************************************
  * @attention
  *
  * Capteur : SGP40 (Sensirion) - VOC (Volatile Organic Compounds)
  * Bus : I2C (adresse fixe 0x59)
  * Mesure : VOC raw signal (0-65535) → VOC index (0-500) via algorithme
  *
  * Conformité : STM32_LIB_STYLE_GUIDE.md v2.0 (volatile sur champs IRQ,
  * DeInit, consecutive_errors, conf.h, guard polling/async, 0 malloc)
  *
  * @note  Délais bloquants : SGP40_MEASURE_WAIT_MS (~30 ms) dans MeasureRaw(),
  *        SGP40_SELFTEST_WAIT_MS (~320 ms) dans SelfTest(). Le mode IT (async)
  *        élimine ces blocages dans la boucle principale.
  *
  * @note  Compatibilité FreeRTOS : SGP40_Init() doit être appelé AVANT
  *        vTaskStartScheduler(). En contexte tâche, protéger l'accès au bus
  *        I2C partagé par un mutex. Ne jamais appeler HAL_Delay() depuis une IRQ.
  *
  * @note  sizeof(SGP40_Handle_t) ≈ 220 bytes (164 opaque algo VOC + contexte).
  *        sizeof(SGP40_Async_t)  ≈  68 bytes.
  *
  ******************************************************************************
  */

#ifndef STM32_SGP40_H
#define STM32_SGP40_H

#ifdef __cplusplus
extern "C" {
#endif

/* ============================================================================
 * Includes
 * ============================================================================ */
#include "main.h"                  ///< HAL multi-famille STM32 via CubeMX
#include "STM32_SGP40_conf.h"      ///< Configuration overridable (timeouts, seuils, debug)
#include <stdint.h>                ///< Types uint8_t, uint16_t, int32_t…
#include <stdbool.h>               ///< Type bool, true, false

/* =============================================================================
 * Constantes
 * ============================================================================= */

/** @brief Taille du buffer opaque interne pour l'algorithme VOC Sensirion.
 *  Correspond à sizeof(GasIndexAlgorithmParams) — vérifié par _Static_assert dans STM32_SGP40.c.
 *  @note Le header vendor sensirion_gas_index_algorithm.h est inclus dans STM32_SGP40.c uniquement.
 */
#define SGP40_VOC_ALGO_OPAQUE_SIZE   164U

#define SGP40_LIB_VERSION_MAJOR      0         ///< Version majeure de la lib
#define SGP40_LIB_VERSION_MINOR      9         ///< Version mineure de la lib
#define SGP40_LIB_VERSION_PATCH      0         ///< Version patch de la lib

/** Adresse I2C SGP40 (profil SINGLE_ADDRESS) */
#define SGP40_I2C_ADDR_7B            0x59U

/** Cadence recommandée pour l'algorithme VOC Index (ms) */
#define SGP40_DEFAULT_SAMPLE_INTERVAL_MS  1000U

/** Commandes SGP40 — datasheet Sensirion SGP40 Rev. 1.1 */
#define SGP40_CMD_MEASURE_RAW        0x260FU   ///< Mesure VOC raw (avec compensation T/RH)
#define SGP40_CMD_MEASURE_TEST       0x280EU   ///< Auto-test capteur
#define SGP40_CMD_HEATER_OFF         0x3615U   ///< Extinction heater (power-down)
#define SGP40_CMD_GET_SERIAL         0x3682U   ///< Lecture serial number (48 bits)

/** Valeurs par défaut compensation T/RH */
#define SGP40_DEFAULT_TEMP_C         25.0f     ///< Température par défaut (°C)
#define SGP40_DEFAULT_RH_PERCENT     50.0f     ///< Humidité relative par défaut (%)

/** CRC-8 polynomial (Sensirion) */
#define SGP40_CRC8_POLYNOMIAL        0x31U     ///< Polynôme CRC8 propriétaire Sensirion
#define SGP40_CRC8_INIT              0xFFU     ///< Valeur initiale CRC8 (standard Sensirion)

/** Tailles internes nommées */
#define SGP40_CMD_DATA_BUF_SIZE      20U       ///< Buffer max pour WriteCommandWithData
#define SGP40_ASYNC_CMD_BUF_SIZE     8U        ///< Buffer commande async (cmd 2B + T/RH 6B)

/** VOC Index (algorithme Sensirion) - plages typiques */
#define SGP40_VOC_INDEX_MIN          0U        ///< Air pur
#define SGP40_VOC_INDEX_TYPICAL      100U      ///< Valeur baseline typique
#define SGP40_VOC_INDEX_MAX          500U      ///< Concentration maximale

/* =============================================================================
 * Types exportés
 * ============================================================================= */

/**
 * @brief Codes d'erreur SGP40
 */
typedef enum {
    SGP40_OK = 0,              ///< Opération réussie
    SGP40_ERR_NULL_PTR,        ///< Pointeur NULL
    SGP40_ERR_INVALID_PARAM,   ///< Paramètre invalide
    SGP40_ERR_NOT_CONFIGURED,  ///< Configuration HAL/NVIC requise absente
    SGP40_ERR_BUSY,            ///< Bus occupé ou cadence non respectée
    SGP40_ERR_I2C,             ///< Erreur I2C (HAL_ERROR/TIMEOUT/BUSY)
    SGP40_ERR_CRC,             ///< CRC8 invalide
    SGP40_ERR_SELF_TEST,       ///< Auto-test échoué
    SGP40_ERR_NOT_READY,       ///< Capteur pas prêt (heater off / non init)
    SGP40_ERR_TIMEOUT,         ///< Timeout mesure ou I2C
    SGP40_ERR_NOT_INITIALIZED, ///< Handle non initialisé (SGP40_Init non appelé)
    SGP40_ERR_OVERFLOW,        ///< File de mesures async pleine (future use)
    SGP40_ERR_UNKNOWN          ///< Erreur inconnue
} SGP40_Status;

/**
 * @brief Handle SGP40 (configuration + état)
 *
 * @note  Base de temps : HAL_GetTick() / HAL_Delay() (SysTick).
 * @note  Champs préfixés async_* modifiés depuis les callbacks HAL (IRQ) →
 *        déclarés volatile pour garantir la cohérence cache/registre ARM.
 * @note  sizeof(SGP40_Handle_t) ≈ 220 bytes — allouer statiquement.
 */
typedef struct {
    /* Configuration I2C --------------------------------------------------- */
    I2C_HandleTypeDef *hi2c;          ///< Handle I2C HAL
    uint8_t            i2c_addr_7b;   ///< Adresse I2C 7-bit (défaut: SGP40_I2C_ADDR_7B)
    uint16_t           i2c_timeout;   ///< Timeout I2C ms (défaut: SGP40_DEFAULT_TIMEOUT_MS)

    /* Compensation T/RH --------------------------------------------------- */
    float temp_c;                     ///< Température (°C) pour compensation
    float rh_percent;                 ///< Humidité relative (%) pour compensation

    /* État capteur --------------------------------------------------------- */
    bool     initialized;             ///< true après SGP40_Init() réussi
    uint64_t serial_number;           ///< Serial number 48 bits (lu au init)
    bool     measurement_mode_active; ///< true après première mesure, false après HeaterOff
    uint32_t sample_interval_ms;      ///< Intervalle minimal entre mesures (ms)
    uint32_t last_measure_tick_ms;    ///< Timestamp (ms) de la dernière mesure

    /* Algorithme VOC Sensirion (opaque) ------------------------------------ */
    /** @brief État interne algorithme VOC Sensirion (opaque — ne pas accéder directement).
     *  Alloué par valeur pour éviter toute allocation dynamique.
     *  Taille vérifiée par _Static_assert dans STM32_SGP40.c.
     */
    uint8_t _voc_algo_opaque[SGP40_VOC_ALGO_OPAQUE_SIZE] __attribute__((aligned(4)));
    bool    voc_algo_initialized;     ///< true si l'algo VOC est initialisé

    /* Mesures -------------------------------------------------------------- */
    uint16_t last_voc_raw;            ///< Dernière valeur VOC raw (0-65535)
    uint32_t measure_count;           ///< Compteur de mesures (pour tracking warmup)

