TutoElectroWeb/STM32_SGP40/STM32_SGP40.h
    /* Suivi erreurs -------------------------------------------------------- */
    volatile uint8_t consecutive_errors; ///< Erreurs I2C consécutives (reset à 0 au succès)
    SGP40_Status     last_error;         ///< Dernier code d'erreur retourné
    uint32_t         last_hal_error;     ///< Dernier code HAL_I2C_GetError() (debug)

    /* Sync async/polling --------------------------------------------------- */
    /** @brief 1 = une opération IT async est en cours sur ce handle.
     *  Modifié depuis les callbacks HAL (IRQ) → volatile obligatoire.
     *  Les fonctions polling vérifient ce flag avant d'accéder au bus I2C.
     */
    volatile uint8_t async_busy;
} SGP40_Handle_t;
typedef SGP40_Handle_t SGP40_HandleTypeDef; ///< Alias CubeMX-style

/**
 * @brief Résultat de SGP40_Async_Tick() — remplace le polling manuel dans while(1)
 *
 * @note  Valeurs fixes (ABI contract inter-lib) :
 *        IDLE=0  BUSY=1  DATA_READY=2  ERROR=3
 */
typedef enum {
    SGP40_TICK_IDLE       = 0,   ///< Aucune mesure en cours
    SGP40_TICK_BUSY       = 1,   ///< Mesure en cours (non-bloquant)
    SGP40_TICK_DATA_READY = 2,   ///< Données disponibles dans *voc_raw_out
    SGP40_TICK_ERROR      = 3    ///< Erreur — FSM réinitialisée automatiquement
} SGP40_TickResult;

/**
 * @brief Catégories VOC Index (interprétation qualité air)
 */
typedef enum {
    SGP40_VOC_EXCELLENT = 0,   ///< 0-100 : Air excellent
    SGP40_VOC_GOOD,            ///< 101-150 : Bon
    SGP40_VOC_MODERATE,        ///< 151-200 : Modéré
    SGP40_VOC_POOR,            ///< 201-300 : Mauvais
    SGP40_VOC_UNHEALTHY,       ///< 301-500 : Insalubre
    SGP40_VOC_INVALID          ///< Hors plage / erreur
} SGP40_VOC_Category;

/* =============================================================================
 * Async (non-bloquant IT)
 * ============================================================================= */

/**
 * @brief Machine d'état pour mesure asynchrone
 *
 * Permet de déclencher une mesure VOC sans bloquer la boucle principale.
 * Utilise le mode IT (interruptions I2C) pour les transferts.
 * DMA non implémenté : aucun gain sur les trames 8B/3B du SGP40.
 */
typedef enum {
    SGP40_ASYNC_IDLE       = 0, ///< Aucune mesure en cours
    SGP40_ASYNC_WRITE_CMD,      ///< Écriture commande + params T/RH
    SGP40_ASYNC_WAIT_MEAS,      ///< Attente délai mesure (30ms)
    SGP40_ASYNC_READ_DATA,      ///< Lecture VOC raw (3 octets: MSB, LSB, CRC)
    SGP40_ASYNC_DONE,           ///< Mesure terminée, données disponibles
    SGP40_ASYNC_ERROR           ///< Erreur survenue
} SGP40_AsyncState;

/**
 * @brief Callback utilisateur - données prêtes
 * @param user_ctx Contexte utilisateur (passé à Init)
 * @param voc_raw  Valeur VOC raw mesurée
 * @param status   Code statut de la mesure
 * @note  Appelé depuis SGP40_Async_Process() (contexte main loop)
 */
typedef void (*SGP40_Async_OnDataReadyCb)(void *user_ctx, uint16_t voc_raw, SGP40_Status status);

/**
 * @brief Callback utilisateur - erreur
 * @param user_ctx Contexte utilisateur
 * @param status   Code erreur
 * @note  Appelé depuis SGP40_Async_Process() (contexte main loop)
 */
typedef void (*SGP40_Async_OnErrorCb)(void *user_ctx, SGP40_Status status);

/**
 * @brief Callback IRQ-safe - données prêtes (depuis interruption I2C)
 * @param user_ctx Contexte utilisateur
 * @note  Appelé depuis HAL I2C callback (interruption) — DOIT être ultra-court.
 * @warning Pas de printf, HAL_Delay, ni opération bloquante ici !
 */
typedef void (*SGP40_Async_OnIrqDataReadyCb)(void *user_ctx);

/**
 * @brief Callback IRQ-safe - erreur (depuis interruption I2C)
 * @param user_ctx Contexte utilisateur
 * @note  Appelé depuis HAL I2C callback (interruption) — DOIT être ultra-court.
 */
typedef void (*SGP40_Async_OnIrqErrorCb)(void *user_ctx);

/**
 * @brief Contexte pour mesure asynchrone SGP40
 *
 * @note  Base de temps : HAL_GetTick() (SysTick).
 * @note  sizeof(SGP40_Async_t) ≈ 68 bytes — allouer statiquement.
 */
typedef struct {
    SGP40_Handle_t    *hsgp40;               ///< Handle SGP40 synchrone (i2c, compensation)
    I2C_HandleTypeDef *hi2c;                 ///< Handle I2C (copié depuis hsgp40)

    volatile SGP40_AsyncState state;         ///< État machine d'état (modifié depuis IRQ)
    volatile SGP40_Status     last_status;   ///< Dernier code erreur (modifié depuis IRQ)

    uint32_t meas_deadline_ms;               ///< Deadline mesure (WAIT_MEAS)
    uint32_t i2c_deadline_ms;               ///< Deadline transfert I2C

    uint8_t  cmd_buf[SGP40_ASYNC_CMD_BUF_SIZE]; ///< Buffer commande (cmd 2B + params 6B)
    uint8_t  rx_buf[3];                      ///< Buffer réception (MSB, LSB, CRC)
    uint16_t voc_raw;                        ///< Dernière valeur VOC raw lue

    volatile bool data_ready_flag;           ///< Flag données prêtes (set depuis ISR)
    volatile bool error_flag;                ///< Flag erreur (set depuis ISR)
    bool notify_data_pending;                ///< Notify data à envoyer (Process)
    bool notify_error_pending;               ///< Notify error à envoyer (Process)

    /* Callbacks utilisateur ----------------------------------------------- */
    SGP40_Async_OnDataReadyCb    on_data_ready;     ///< Données prêtes (main loop, peut être NULL)
    SGP40_Async_OnErrorCb        on_error;           ///< Erreur (main loop, peut être NULL)
    SGP40_Async_OnIrqDataReadyCb on_irq_data_ready; ///< Données prêtes depuis IRQ (ultra-court)
    SGP40_Async_OnIrqErrorCb     on_irq_error;      ///< Erreur depuis IRQ (ultra-court)
    void                        *user_ctx;           ///< Contexte utilisateur passé aux callbacks
} SGP40_Async_t;

/* =============================================================================
 * API synchrone (bloquante)
 * ============================================================================= */

/**
 * @brief Initialise le capteur SGP40 (config + serial + algo VOC + prime)
 * @param hsgp40 Handle SGP40 (non NULL)
 * @param hi2c   Handle I2C HAL (non NULL)
 * @retval SGP40_Status
 * @note  Configure tous les défauts (addr, timeout, T/RH, intervalle).
 *        Effectue une mesure de chauffe silencieuse (prime) automatiquement.
 *        Configure les valeurs par défaut, cadence et amorçage VOC en une seule init.
 */
SGP40_Status SGP40_Init(SGP40_Handle_t *hsgp40, I2C_HandleTypeDef *hi2c);

/**
 * @brief Réinitialise le handle SGP40 (libère ressources logicielles)
 * @param hsgp40 Handle SGP40 (non NULL)
 * @retval SGP40_Status
 * @note  Remet h à zéro (initialized=false, async_busy=0, hi2c=NULL).
 *        À appeler en cas d'erreur fatale, avant bootloader, ou en test unitaire.
 *        Retourne SGP40_ERR_BUSY si une opération IT async est en cours.
 */
SGP40_Status SGP40_DeInit(SGP40_Handle_t *hsgp40);

/**
 * @brief Lecture serial number 48 bits
 * @param hsgp40 Handle SGP40
 * @param serial Pointeur pour stocker serial (6 octets)
 * @retval SGP40_Status
 */
SGP40_Status SGP40_GetSerialNumber(SGP40_Handle_t *hsgp40, uint64_t *serial);

/**
 * @brief Auto-test capteur (heater + sensor)
 * @param hsgp40      Handle SGP40
 * @param test_result Résultat test (pattern 0xD4XX = OK, 0x4BXX = échec)
 * @retval SGP40_Status
 * @note  Bloquant jusqu'à SGP40_SELFTEST_WAIT_MS (320 ms).
 */
SGP40_Status SGP40_SelfTest(SGP40_Handle_t *hsgp40, uint16_t *test_result);

/**
 * @brief Mesure VOC raw (signal brut 0-65535)
 * @param hsgp40  Handle SGP40
 * @param voc_raw Pointeur pour stocker signal VOC raw
 * @retval SGP40_Status
 * @note  Bloquant ~SGP40_MEASURE_WAIT_MS (30 ms), utilise compensation T/RH.
 *        Retourne SGP40_ERR_BUSY si async en cours ou cadence non respectée.
 */
SGP40_Status SGP40_MeasureRaw(SGP40_Handle_t *hsgp40, uint16_t *voc_raw);

/**
 * @brief Prime le capteur pour usage VOC Index (discard première mesure)
 * @param hsgp40 Handle SGP40
 * @retval SGP40_Status
 * @note  Recommandé après Init() avant d'alimenter l'algorithme VOC Index.
 */
SGP40_Status SGP40_PrimeForVocIndex(SGP40_Handle_t *hsgp40);

/**
 * @brief Configure l'intervalle minimal entre mesures
 * @param hsgp40      Handle SGP40
 * @param interval_ms Intervalle en ms (plage supportée: 500..10000)
 * @retval SGP40_Status
 */
SGP40_Status SGP40_SetSampleInterval(SGP40_Handle_t *hsgp40, uint32_t interval_ms);

/**
 * @brief Configure compensation température/humidité
 * @param hsgp40     Handle SGP40
 * @param temp_c     Température (°C), plage -45 à +130
 * @param rh_percent Humidité relative (%), plage 0 à 100
 * @retval SGP40_Status
 */
SGP40_Status SGP40_SetCompensation(SGP40_Handle_t *hsgp40, float temp_c, float rh_percent);

/**
 * @brief Extinction heater (mode power-down)
 * @param hsgp40 Handle SGP40
 * @retval SGP40_Status
 * @note  Réduit consommation ~0.1µA, nécessite SGP40_Init() après réutilisation.
 */
SGP40_Status SGP40_HeaterOff(SGP40_Handle_t *hsgp40);

/**
 * @brief Calcule VOC Index depuis VOC raw (algorithme officiel Sensirion)
 * @param hsgp40    Handle SGP40 (contient l'état interne de l'algorithme)
 * @param voc_raw   Signal VOC raw (0-65535)
 * @param voc_index Pointeur pour stocker VOC index (0-500)
 * @retval SGP40_Status
 * @note  Conserver une cadence constante (recommandé 1s).
 */
SGP40_Status SGP40_CalculateVOCIndex(SGP40_Handle_t *hsgp40, uint16_t voc_raw, uint16_t *voc_index);

/**
 * @brief Reset des états internes de l'algorithme VOC Sensirion
 * @param hsgp40 Handle SGP40
 * @retval SGP40_Status
 */
SGP40_Status SGP40_VOCAlgoReset(SGP40_Handle_t *hsgp40);

/**
 * @brief Récupère les états VOC (pour persistance / reprise)
 * @param hsgp40 Handle SGP40
 * @param state0 Sortie état 0
 * @param state1 Sortie état 1
 * @retval SGP40_Status
 */
SGP40_Status SGP40_VOCAlgoGetStates(const SGP40_Handle_t *hsgp40, float *state0, float *state1);

/**
 * @brief Restaure les états VOC (reprise après interruption courte)
 * @param hsgp40 Handle SGP40
 * @param state0 État 0
 * @param state1 État 1
 * @retval SGP40_Status
 */
SGP40_Status SGP40_VOCAlgoSetStates(SGP40_Handle_t *hsgp40, float state0, float state1);

/**
 * @brief Configure les paramètres de tuning de l'algorithme VOC
 * @param hsgp40                       Handle SGP40
 * @param index_offset                 Offset index (1..250)
 * @param learning_time_offset_hours   Temps apprentissage offset (1..1000h)
 * @param learning_time_gain_hours     Temps apprentissage gain (1..1000h)
 * @param gating_max_duration_minutes  Durée max gating (0..3000min)
 * @param std_initial                  Écart-type initial (10..5000)
 * @param gain_factor                  Gain (1..1000)
 * @retval SGP40_Status
 */
SGP40_Status SGP40_VOCAlgoSetTuning(
    SGP40_Handle_t *hsgp40,
    int32_t index_offset,
    int32_t learning_time_offset_hours,
    int32_t learning_time_gain_hours,
    int32_t gating_max_duration_minutes,
    int32_t std_initial,
    int32_t gain_factor
);

/**
 * @brief Lit les paramètres de tuning de l'algorithme VOC
 * @param hsgp40                       Handle SGP40
 * @param index_offset                 Sortie
 * @param learning_time_offset_hours   Sortie
 * @param learning_time_gain_hours     Sortie
 * @param gating_max_duration_minutes  Sortie
 * @param std_initial                  Sortie
 * @param gain_factor                  Sortie
 * @retval SGP40_Status
 */
SGP40_Status SGP40_VOCAlgoGetTuning(
    const SGP40_Handle_t *hsgp40,
    int32_t *index_offset,
    int32_t *learning_time_offset_hours,
    int32_t *learning_time_gain_hours,
    int32_t *gating_max_duration_minutes,
    int32_t *std_initial,
    int32_t *gain_factor
);

/**
 * @brief Lit l'intervalle d'échantillonnage utilisé par l'algorithme (secondes)
 * @param hsgp40              Handle SGP40
 * @param sampling_interval_s Sortie intervalle (s)
 * @retval SGP40_Status
 */
SGP40_Status SGP40_VOCAlgoGetSamplingInterval(const SGP40_Handle_t *hsgp40, float *sampling_interval_s);

/**
 * @brief Catégorise VOC Index (qualité air)
 * @param voc_index VOC index (0-500)
 * @retval SGP40_VOC_Category
 */
SGP40_VOC_Category SGP40_GetVOCCategory(uint16_t voc_index);

/**
 * @brief Conversion VOC category → texte (description)
 * @param category Catégorie VOC
 * @retval Chaîne statique (ne pas libérer)
 */
const char *SGP40_VOCCategoryToString(SGP40_VOC_Category category);

/**
 * @brief Conversion code erreur → texte (debug uniquement)
 * @param code Code erreur SGP40
 * @retval Chaîne statique (ne pas libérer), "" si SGP40_DEBUG_ENABLE non défini
 * @note  Protégé par #ifdef SGP40_DEBUG_ENABLE pour économiser la Flash en production.
 *        Activer dans STM32_SGP40_conf.h ou via -DSGP40_DEBUG_ENABLE.
 */
#ifdef SGP40_DEBUG_ENABLE
const char *SGP40_StatusToString(SGP40_Status code);
#endif /* SGP40_DEBUG_ENABLE */

