TutoElectroWeb/STM32_SGP40/STM32_SGP40.h
/* =============================================================================
 * Fonctions convenience (warmup + mesure tout-en-un)
 * ============================================================================= */

/**
 * @brief Vérifie si la phase de warmup de l'algorithme VOC est terminée
 * @param hsgp40 Handle SGP40 (non NULL)
 * @retval true si measure_count >= GasIndexAlgorithm_INITIAL_BLACKOUT
 * @note  Évite l'accès direct à la constante Sensirion dans le code utilisateur.
 */
bool SGP40_IsVOCWarmupComplete(const SGP40_Handle_t *hsgp40);

/**
 * @brief Retourne le nombre d'échantillons nécessaires au warmup de l'algo VOC
 * @param hsgp40 Handle SGP40 (non NULL) — intervalle utilisé pour le calcul
 * @retval ceil(45 s / sample_interval_s) — ex. 45 @ 1 Hz, 90 @ 500 ms, 23 @ 2 s
 * @note   Retourne 45 (valeur 1 Hz) si hsgp40 est NULL.
 */
uint32_t SGP40_GetVOCWarmupSamples(const SGP40_Handle_t *hsgp40);

/**
 * @brief Mesure VOC raw + calcul VOC Index en un seul appel
 * @param hsgp40    Handle SGP40 (non NULL, initialisé)
 * @param voc_raw   Pointeur pour stocker signal VOC raw (peut être NULL)
 * @param voc_index Pointeur pour stocker VOC index 0-500 (non NULL)
 * @retval SGP40_Status
 * @note  Bloquant ~SGP40_MEASURE_WAIT_MS. Combine MeasureRaw() + CalculateVOCIndex().
 */
SGP40_Status SGP40_MeasureVOCIndex(SGP40_Handle_t *hsgp40, uint16_t *voc_raw, uint16_t *voc_index);

/* =============================================================================
 * API Asynchrone (IT)
 * ============================================================================= */

/**
 * @brief Initialise contexte asynchrone
 * @param ctx    Contexte async à initialiser
 * @param hsgp40 Handle SGP40 synchrone (doit être déjà initialisé)
 * @note  Réinitialise tous les flags et callbacks.
 */
void SGP40_Async_Init(SGP40_Async_t *ctx, SGP40_Handle_t *hsgp40);

/**
 * @brief Reset la machine d'état async sans perdre les callbacks/timebase
 * @param ctx Contexte async (non NULL)
 * @note  Préserve : hsgp40, hi2c, tous les callbacks, user_ctx.
 *        Remet : state=IDLE, flags=false, buffers=0, deadlines=0.
 *        Utile pour récupération d'erreur sans ré-appeler Init+SetCallbacks.
 */
void SGP40_Async_Reset(SGP40_Async_t *ctx);

/**
 * @brief Configure callbacks utilisateur (contexte main loop)
 * @param ctx          Contexte async
 * @param on_data_ready Callback données prêtes (peut être NULL)
 * @param on_error     Callback erreur (peut être NULL)
 * @param user_ctx     Pointeur utilisateur passé aux callbacks
 */
void SGP40_Async_SetCallbacks(SGP40_Async_t *ctx,
                               SGP40_Async_OnDataReadyCb on_data_ready,
                               SGP40_Async_OnErrorCb on_error,
                               void *user_ctx);

/**
 * @brief Configure callbacks IRQ-safe (depuis interruptions I2C)
 * @param ctx              Contexte async
 * @param on_irq_data_ready Callback IRQ données prêtes (peut être NULL)
 * @param on_irq_error     Callback IRQ erreur (peut être NULL)
 * @param user_ctx         Pointeur utilisateur passé aux callbacks
 * @warning Ces callbacks sont appelés depuis interruption — garder ultra-courts !
 */
void SGP40_Async_SetIrqCallbacks(SGP40_Async_t *ctx,
                                  SGP40_Async_OnIrqDataReadyCb on_irq_data_ready,
                                  SGP40_Async_OnIrqErrorCb on_irq_error,
                                  void *user_ctx);

/**
 * @brief Lecture flag données prêtes
 * @param ctx Contexte async
 * @retval true si données disponibles
 */
bool SGP40_Async_DataReadyFlag(const SGP40_Async_t *ctx);

/**
 * @brief Lecture flag erreur
 * @param ctx Contexte async
 * @retval true si erreur survenue
 */
bool SGP40_Async_ErrorFlag(const SGP40_Async_t *ctx);

/**
 * @brief Clear flags data_ready et error
 * @param ctx Contexte async
 */
void SGP40_Async_ClearFlags(SGP40_Async_t *ctx);

/**
 * @brief Vérifie si machine d'état idle
 * @param ctx Contexte async
 * @retval true si IDLE (pas de mesure en cours)
 */
bool SGP40_Async_IsIdle(const SGP40_Async_t *ctx);

/**
 * @brief Vérifie si données disponibles
 * @param ctx Contexte async
 * @retval true si état DONE avec données valides
 */
bool SGP40_Async_HasData(const SGP40_Async_t *ctx);

/**
 * @brief Déclenche mesure VOC en mode IT (non-bloquant)
 * @param ctx Contexte async
 * @retval SGP40_Status (SGP40_OK si lancé, erreur sinon)
 * @note  Utilise HAL_I2C_Master_Transmit_IT. DMA non implémenté : aucun gain
 *        pour les trames SGP40 (8B TX / 3B RX) — IT suffit sans surcoût DMA.
 */
SGP40_Status SGP40_ReadAll_IT(SGP40_Async_t *ctx);

/**
 * @brief Machine d'état async — à appeler dans main loop
 * @param ctx    Contexte async
 * @param now_ms Temps actuel HAL_GetTick()
 * @retval None — consulter ctx->last_status ou SGP40_Async_GetTickResult() pour le statut
 * @note  Gère transitions d'état, timeouts, et appelle callbacks utilisateur.
 *        Ne remet pas automatiquement l'état à IDLE après DONE.
 */
void SGP40_Async_Process(SGP40_Async_t *ctx, uint32_t now_ms);

/**
 * @brief Récupère dernière mesure VOC raw
 * @param ctx     Contexte async
 * @param voc_raw Pointeur pour stocker VOC raw
 * @retval SGP40_Status (OK si données valides, erreur sinon)
 * @note  Consomme la mesure et remet l'état à IDLE après lecture.
 */
SGP40_Status SGP40_Async_GetData(SGP40_Async_t *ctx, uint16_t *voc_raw);

/**
 * @brief Callback HAL - Tx I2C terminé (mode IT)
 * @param ctx  Contexte async
 * @param hi2c Handle I2C
 * @note  À appeler depuis HAL_I2C_MasterTxCpltCallback.
 *        Filtre sur hi2c : ignore si différent du handle configuré.
 */
void SGP40_Async_OnI2CMasterTxCplt(SGP40_Async_t *ctx, I2C_HandleTypeDef *hi2c);

/**
 * @brief Callback HAL - Rx I2C terminé (mode IT)
 * @param ctx  Contexte async
 * @param hi2c Handle I2C
 * @note  À appeler depuis HAL_I2C_MasterRxCpltCallback.
 *        Filtre sur hi2c : ignore si différent du handle configuré.
 */
void SGP40_Async_OnI2CMasterRxCplt(SGP40_Async_t *ctx, I2C_HandleTypeDef *hi2c);

/**
 * @brief Callback HAL - Erreur I2C
 * @param ctx  Contexte async
 * @param hi2c Handle I2C
 * @note  À appeler depuis HAL_I2C_ErrorCallback.
 *        Filtre sur hi2c : ignore si différent du handle configuré.
 */
void SGP40_Async_OnI2CError(SGP40_Async_t *ctx, I2C_HandleTypeDef *hi2c);

