TutoElectroWeb/STM32_SGP40/STM32_SGP40.h
/* =============================================================================
 * Helpers haut niveau (réduisent le boilerplate utilisateur)
 * ============================================================================= */

/**
 * @brief Avance la FSM, récupère les données si prêtes, remet à IDLE si erreur.
 *        Remplace Process() + flag polling + GetData() + ClearFlags() + Reset().
 * @param ctx         Contexte async
 * @param now_ms      HAL_GetTick()
 * @param voc_raw_out Sortie VOC raw si TICK_DATA_READY (peut être NULL)
 * @retval SGP40_TICK_DATA_READY  données prêtes dans *voc_raw_out
 *         SGP40_TICK_ERROR       erreur — FSM remise à IDLE automatiquement
 *         SGP40_TICK_BUSY        mesure en cours
 *         SGP40_TICK_IDLE        rien en cours
 */
SGP40_TickResult SGP40_Async_Tick(SGP40_Async_t *ctx, uint32_t now_ms, uint16_t *voc_raw_out);

/**
 * @brief Déclenche ReadAll_IT() si IDLE && intervalle écoulé (stocké dans hsgp40).
 *        Met à jour *last_ms uniquement si le trigger réussit.
 * @note  Compatible partage de bus I2C multi-capteurs : si le bus est occupé
 *        (autre capteur en transfert), retente automatiquement sur les appels suivants.
 * @param ctx     Contexte async
 * @param now_ms  HAL_GetTick()
 * @param last_ms Pointeur vers le timestamp du dernier trigger (mis à jour)
 * @retval SGP40_OK          trigger lancé, OU délai non encore écoulé (pas une erreur)
 *         SGP40_ERR_BUSY    FSM non idle (mesure déjà en cours)
 *         autre             erreur I2C/config
 */
SGP40_Status SGP40_Async_TriggerEvery(SGP40_Async_t *ctx, uint32_t now_ms,
                                       uint32_t *last_ms);

/**
 * @brief Tick + calcul VOC Index en un seul appel — réduit le boilerplate while(1).
 * @details Remplace le pattern `SGP40_Async_Tick() + SGP40_CalculateVOCIndex()` par
 *          un seul appel. Si la donnée n'est pas encore prête, retourne TICK_IDLE ou
 *          TICK_BUSY sans effet de bord.
 * @note  Compatible multi-lib IT : grâce au fix HAL_BUSY TX, la FSM reste IDLE si
 *        le bus est occupé par une autre lib (STM32_AHT20, STM32_BME280...).
 *        TICK_ERROR n'est donc émis que pour de vraies erreurs I2C ou de timeout.
 * @param ctx           Contexte async (non NULL)
 * @param now_ms        HAL_GetTick()
 * @param voc_raw_out   Sortie VOC brut en ticks (peut être NULL)
 * @param voc_index_out Sortie VOC Index 0–500 (non NULL)
 * @retval SGP40_TICK_DATA_READY  index valide dans *voc_index_out
 *         SGP40_TICK_IDLE        FSM idle, pas de mesure en cours
 *         SGP40_TICK_BUSY        mesure en cours, résultat pas encore prêt
 *         SGP40_TICK_ERROR       erreur I2C ou algo VOC, voir ctx->last_status
 */
SGP40_TickResult SGP40_Async_TickIndex(SGP40_Async_t *ctx, uint32_t now_ms,
                                       uint16_t *voc_raw_out, uint16_t *voc_index_out);

#ifdef __cplusplus
}
#endif

#endif /* STM32_SGP40_H */
